//-----------------------------------------------------------------------------------------------------
using System;
using System.Collections.Generic;
using System.Text;
//-----------------------------------------------------------------------------------------------------
namespace GGPlatform.ExcelManagers
{
    //-----------------------------------------------------------------------------------------------------
    public static class ExceptionStrings
    {
        public static string[] ExceptionMessages = 
        { 
            "Необходимо указать имя шаблона при открытии Excel документа!",
            "Ошибка создания Excel документа!\nВозможно приложение MS Excel не установлено на данном компьютере",
            "Необходимо указать имя листа в шаблоне документа!",
            "Входной поток шаблона документа не инициализирован",
            "Ошибка создания Excel документа!\nВозможно отсутствуют библиотеки OpenXML на данном компьютере",
            "Допустимы только документы версии Excel 2007 и позднее!",
        };
    }
    //-----------------------------------------------------------------------------------------------------
    public class ExceptionManeger : Exception
    {
        private string MessageString;
        //-----------------------------------------------------------------------------------------------------

        public string PMessageString
        {
            get { return MessageString; }
        }
        //-----------------------------------------------------------------------------------------------------
        public ExceptionManeger(string InputMessageString)
        {
            MessageString = InputMessageString;
        }
        //-----------------------------------------------------------------------------------------------------
    }
    //-----------------------------------------------------------------------------------------------------
}
//-----------------------------------------------------------------------------------------------------
